"""
Печать координат прямоугольной сетки 
"""

import numpy as np

# Квадратна сетка 18*18
# nij = [18 for i in range(18)]



# Колличество каналов в ряду. Картограмма реактора РБМК, 1884 канала
nij =  [14, 20, 24, 28, 30, 32, 34, 36, 38, 40, 42, 42, 44, 44, 46, 46, 46,
        48, 48, 48, 48, 48, 48, 48,
        48, 48, 48, 48, 48, 48, 48,
        46, 46, 46, 44, 44, 42, 42, 40, 38, 36, 34, 32, 30, 28, 24, 20, 14]


# Колличество каналов в ряду. Картограмма реактора БРЕСТ-1200, 540 каналов
nij =  [ 8, 12, 16, 18, 20, 22, 22, 24, 24, 26, 26, 26, 26, 
        26, 26, 26, 26, 24, 24, 22, 22, 20, 18, 16, 12,  8]


nx = len(nij) # число рядов

scale = 1.0
dx, dy = scale*1.0, scale*1.0 # шаг решетки
f = open("..\\square540.net","w") # название файла, в который записываются данные
i = 0
for n in range(nx):
    for k in range(-nij[n]/2, nij[n]/2):
        x = 2*dx*k
        y = 2*n*dy
        i = i + 1
        f.write("""%i %f %f \n"""%(i,x,y))
f.close()
